Autodesk.Revit.DB.FamilyInstance.GetReferenceName(Autodesk.Revit.DB.Reference)
Gets the name of the reference plane in the family corresponding to the given family instance reference.
Remarks:
If the given family reference corresponds to a named reference plane in the instance's family, the name of that reference plane will be returned.
Otherwise, an empty string will be returned.
reference:
The family instance reference.
Returns:
Returns the name of the reference plane in the family corresponding to the given family instance reference.
If the reference doesn't correspond to a named reference plane, returns an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.FamilyInstance.GetReferenceByName(System.String)
Gets the family instance reference corresponding to the named reference plane in the instance's family.
Remarks:
If there is a reference plane in the instance's family that has the given name, and the plane's "Is Reference" property is not "Not a Reference",
there will be a corresponding reference in the family's instance.  This function returns that reference.
name:
The name of the reference plane in the family.
Returns:
Returns the family instance reference corresponding to the named reference plane in the instance's family.
Returns null if there is no reference plane with this name in the family, or if the plane exists but its "Is Reference" property is "Not a Reference",
or if the input string is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.FamilyInstance.GetReferenceType(Autodesk.Revit.DB.Reference)
Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
reference:
The family instance reference.
Returns:
Returns the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
Returns FamilyInstanceReferenceType.NotAReference if the instance reference doesn't correspond to a reference plane or line in the family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.FamilyInstance.GetReferences(Autodesk.Revit.DB.FamilyInstanceReferenceType)
Gets family instance references corresponding to the reference planes or reference lines of the given reference type in the instance's family.
Remarks:
Reference planes from the instance's family that have their "Is Reference" property set to "Not a Reference" do not create references in the family instance.
referenceType:
The family reference type.
Returns:
Returns all the family instance references corresponding to reference planes and reference lines of the given reference type.
Returns null if there are no family instance references of the given reference type, or if the input reference type is FamilyInstanceReferenceType.NotAReference.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FamilyInstance.ToRoom(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The "To Room" set for the door or window in the given phase of the project.
Remarks: Revit automatically calculates the "To Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "To Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "To Room" set for the door or window in the given phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the given phase, or phase does not apply to this FamilyInstance.
phase: Phase of the project.

Autodesk.Revit.DB.FamilyInstance.ToRoom
The "To Room" set for the door or window.
The "To Room" set for the door or window in the last phase of the project.
Remarks: Revit automatically calculates the "To Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "To Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "To Room" set for the door or window in the last phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the last phase, or phase does not apply to this FamilyInstance.

Autodesk.Revit.DB.FamilyInstance.FromRoom(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The "From Room" set for the door or window in the given phase of the project.
Remarks: Revit automatically calculates the "From Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "From Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "From Room" set for the door or window in the given phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the given phase, or phase does not apply to this FamilyInstance.
phase: Phase of the project.

Autodesk.Revit.DB.FamilyInstance.FromRoom
The "From Room" set for the door or window.
The "From Room" set for the door or window in the last phase of the project.
Remarks: Revit automatically calculates the "From Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "From Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "From Room" set for the door or window in the last phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the last phase, or phase does not apply to this FamilyInstance.

Autodesk.Revit.DB.FamilyInstance.Space(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The space in which the instance is located in the given phase of the project.
phase: The phase in which to look for a space that contains the instance.
Remarks: This property will be the first space encountered that contains the instance. If more than
one space includes this point in its volume only the first one is returned.
If no space is found that contains the instance, or if phase does not apply to this FaimlyInstance,
this property is null.

Autodesk.Revit.DB.FamilyInstance.Space
The space in which the instance is located.
The space in which the instance is located (during the last phase of the project).
Remarks: This property will be the first space encountered that contains the instance. If more than
one space includes this point in its volume only the first one is returned.
If no space is found that contains the instance, or if phase does not apply to this FaimlyInstance,
this property is null.

Autodesk.Revit.DB.FamilyInstance.Room(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The room in which the instance is located in the given phase of the project.
phase: The phase in which to look for a room that contains the instance.
Remarks: This property will be the first room encountered that contains the instance. If more than
one room includes this point in its volume only the first one is returned.
If no room is found that contains the instance, or if phase does not apply to this FaimlyInstance,
this property is null.
This property should not be used for door or window instances, which are placed on the boundary or
between rooms.  Use the Autodesk.Revit.DB.FamilyInstance.FromRoom and Autodesk.Revit.DB.FamilyInstance.ToRoom properties instead.

Autodesk.Revit.DB.FamilyInstance.Room
The room in which the instance is located.
The room in which the instance is located (during the last phase of the project).
Remarks: This property will be the first room encountered that contains the instance. If more than
one room includes this point in its volume only the first one is returned.
If no room is found that contains the instance, or if phase does not apply to this FaimlyInstance,
this property is null.
This property should not be used for door or window instances, which are placed on the boundary or
between rooms.  Use the Autodesk.Revit.DB.FamilyInstance.FromRoom and Autodesk.Revit.DB.FamilyInstance.ToRoom properties instead.

Autodesk.Revit.DB.FamilyInstance
This object represents a single instance of a family type, such as a single I beam.
Remarks:
Examples of FamilyInstance objects within Autodesk Revit are Beams, Columns,
Braces and Desks. The FamilyInstance object provides more detailed properties that
enable the type of the family instance to be changed, thus changing their appearance
within the project.